app/views/users/usertable.html.erb

		<td> <%= user.email%> </td>
		<td> <%=user.participations.count%></td>
---
SELECT COUNT(*) FROM "participations" WHERE ("participations".user_id = 1)