app/controllers/events_controller.rb

	def index
		if current_user
			@events= Event.all
---
SELECT "events".* FROM "events"

	def create
		@event=Event.new(params[:event])
		@event.author = current_user

		if @event.save
---
INSERT INTO "events" ("start_date", "end_date", "author_id", "event_type", "event_name", "updated_at", "created_at", "event_dscrip") VALUES (NULL, NULL, 2, '', '', '2011-07-07 05:47:51.584871', '2011-07-07 05:47:51.584871', 'zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz') RETURNING "id"

	def diff_user
		@user=User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

	def all_seminars
		@events=Event.all
---
SELECT "events".* FROM "events"

	def all_lectures
		@events=Event.all
---
SELECT "events".* FROM "events"

	def all_conferences
		@events=Event.all
---
SELECT "events".* FROM "events"

	def destroy
		@event=Event.find(params[:id])
		if @event.author==current_user
			@event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
DELETE FROM "events" WHERE "events"."id" = 1

	def diff_seminars
		@user=User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1

	def diff_lectures
		@user=User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1

	def diff_conferences
		@user=User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1