app/controllers/participations_controller.rb

	def create
		@event=Event.find(params[:event_id])
		@participation=@event.participations.create(params[:participation])
		@participation.user = current_user
		@participation.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = 14 LIMIT 1
INSERT INTO "participations" ("remarks", "created_at", "event_id", "updated_at", "user_id") VALUES ('lawl ahhaha', '2011-07-05 06:43:06.714774', 16, '2011-07-05 06:43:06.714774', NULL) RETURNING "id"
UPDATE "participations" SET "user_id" = 3, "updated_at" = '2011-07-04 06:54:51.975167' WHERE "participations"."id" = 8

	def destroy
		@participation=Participation.find(params[:id])
		@participation.destroy
---
SELECT "participations".* FROM "participations" WHERE "participations"."id" = 24 LIMIT 1
DELETE FROM "participations" WHERE "participations"."id" = 24