app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def usertable
		@users=User.all

INSERT INTO "users" ("updated_at", "created_at", "password_hash", "email", "password_salt") VALUES ('2011-06-30 05:28:26.253898', '2011-06-30 05:28:26.253898', '$2a$10$B6XVvlsE9RuSP4gYeuKztux7PXGkHtdKSK0PgHo9VI.Q8xPPpGuQ.', 'vikram.653@gmail.com', '$2a$10$B6XVvlsE9RuSP4gYeuKztu') RETURNING "id"
---
  def create
   	@user=User.new(params[:user])
    if @user.save